nradulovic/neon-v2/variant/arch/pic32/neon_uart.c
/*
 * Neon
 * Copyright (C) 2018   REAL-TIME CONSULTING
 *
 * This program is free software: you can redistribute it and/or modify it
 * under the terms of the GNU Lesser General Public License as published by the Free
 * Software Foundation, either version 3 of the License, or (at your option)
 * any later version.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE.  See the GNU Lesser General Public License for
 * more details.
 *
 * You should have received a copy of the GNU Lesser General Public License along
 * with this program. If not, see <http://www.gnu.org/licenses/>.
 */

#include <xc.h>
#include <sys/attribs.h>

#include "neon.h"
#include "pic32_isr.h"
#include "pic32_uart.h"
#include "pic32_common.h"
#include "pic32_osc.h"

#if defined(__32MX534F064H__)
#define HAS_MODE_UEN
#define HAS_MODE_RTSMD
#define HAS_MODE_RUNOVF
#define HAS_MODE_CLKSEL
#define HAS_MODE_ACTIVE
#define HAS_MODE_SLPEN
#define HAS_STA_ADM_EN
#define HAS_TX_FIFO 8
#define HAS_RX_FIFO 8
#endif


#define UxMODE_STSEL_Pos                0
#define UxMODE_PDSEL_Pos                1
#define UxMODE_BRGH_Pos                 3
#define UxMODE_RXINV_Pos                4
#define UxMODE_UEN_Pos                  8
#define UxMODE_ON_Pos                   15
#define UxMODE_ACTIVE_Pos               22

#define UxSTA_OERR_Pos                  1
#define UxSTA_FERR_Pos                  2
#define UxSTA_PERR_Pos                  3
#define UxSTA_UTXEN_Pos                 10
#define UxSTA_URXEN_Pos                 12
#define UxSTA_UTXINV_Pos                13
#define UxSTA_UTXISEL_Pos               14

#define UART_E                          0
#define UART_RX                         1
#define UART_TX                         2

struct pic32_uart_sfr
{
    struct pic32_periph_reg mode;
    struct pic32_periph_reg sta;
    struct pic32_periph_reg txreg;
    struct pic32_periph_reg rxreg;
    struct pic32_periph_reg brg;
};

struct pic32_uart_desc
{
    const struct pic32_uart_board_config * board_config;
    uint32_t capabilities;
    uint8_t vector_id_e_rx_tx;
};

struct pic32_uart
{
    struct pic32_uart_sfr * sfr;
    const struct pic32_uart_desc * desc;
    nuart_callback * callback;
    const void * buff_out;
    void * buff_in;
    size_t buff_size;
};

#if (NBOARD_USES_UART_1 == 1)
static const struct pic32_uart_desc g_uart_1_desc =
{
    .board_config = &NBOARD_UART_1_CONFIG,
    .capabilities = NUART_CAPA_ASYNCHRONOUS,
    .isr_e_tx_rx_id = PIC32_ISR_U1E_RX_TX,
};
#endif

#if (NBOARD_USES_UART_2 == 1)
static const struct pic32_uart_desc g_uart_2_desc =
{
    .board_config = &NBOARD_UART_2_CONFIG,
    .capabilities = NUART_CAPA_ASYNCHRONOUS,
    .isr_e_tx_rx_id = PIC32_ISR_U2E_RX_TX,
};
#endif

#if (NBOARD_USES_UART_3 == 1)
static const struct pic32_uart_desc g_uart_3_desc =
{
    .board_config = &NBOARD_UART_3_CONFIG,
    .capabilities = NUART_CAPA_ASYNCHRONOUS,
    .isr_e_tx_rx_id = PIC32_ISR_U3E_RX_TX,
};
#endif

#if (NBOARD_USES_UART_4 == 1)
static const struct pic32_uart_desc g_uart_4_desc =
{
    .board_config = &NBOARD_UART_4_CONFIG,
    .capabilities = NUART_CAPA_ASYNCHRONOUS,
    .vector_id_e_rx_tx = PIC32_ISR_U4E_RX_TX,
};
#endif

#if (NBOARD_USES_UART_5 == 1)
static const struct pic32_uart_desc g_pic32_uart_5_desc =
{
    .board_config = &PIC32_UART_5_BOARD_CONFIG,
    .capabilities = NUART_CAPA_ASYNCHRONOUS,
    .vector_id_e_rx_tx = PIC32_ISR_U5E_RX_TX,
};
#endif

static struct pic32_uart g_pic32_uarts[] =
{
#if (NBOARD_USES_UART_1 == 1)
    {
        .sfr = (struct pic32_uart_sfr *)&U1MODE,
        .desc = &g_uart_1_desc
    },
#endif
#if (NBOARD_USES_UART_2 == 1)
    {
        .sfr = (struct pic32_uart_sfr *)&U2MODE,
        .desc = &g_uart_2_desc
    },
#endif
#if (NBOARD_USES_UART_3 == 1)
    {
        .sfr = (struct pic32_uart_sfr *)&U3MODE,
        .desc = &g_uart_3_desc
    },
#endif
#if (NBOARD_USES_UART_4 == 1)
    {
        .sfr = (struct pic32_uart_sfr *)&U4MODE,
        .desc = &g_uart_4_desc
    },
#endif
#if (NBOARD_USES_UART_5 == 1)
    {
        .sfr = (struct pic32_uart_sfr *)&U5MODE,
        .desc = &g_pic32_uart_5_desc
    },
#endif
    /* There are no more than 5 UARTs available on any PIC32 */
};

static void pic32_uart_setup_baudrate(
        struct pic32_uart_sfr * sfr, 
        uint32_t baudrate)
{
    uint32_t pbclk;

    pbclk = pic32_osc_get_pbclk_hz();
    
    if (baudrate > (pbclk / 16)) {
        sfr->mode.set = 0x1ul << UxMODE_BRGH_Pos;
        sfr->brg.reg = pbclk / (4ul * baudrate) - 1ul;
    } else {
        sfr->brg.reg = pbclk / (16ul * baudrate) - 1ul;
    }
}

static void pic32_uart_setup(
        struct pic32_uart * uart, 
        uint32_t control_code, 
        uint32_t arg)
{
    uint32_t data_bits = control_code & NUART_DATA_BITS_Msk;
    uint32_t stop_bits = control_code & NUART_STOP_BITS_Msk;
    uint32_t parity = control_code & NUART_PARITY_Msk;
    struct pic32_uart_sfr * sfr = uart->sfr;
    
    NASSERT((control_code & NUART_MODE_Msk) == NUART_MODE_ASYNCHRONOUS);

#if defined(HAS_MODE_ACTIVE)
    while (sfr->mode.reg & (0x1ul << UxMODE_ACTIVE_Pos));
#endif
    sfr->sta.reg = 0ul;
    sfr->mode.reg = 0ul;
         
    /* Setup baudrate */
    pic32_uart_setup_baudrate(sfr, arg);

    /* Setup stop bits */
    NASSERT((stop_bits == NUART_STOP_BITS_1) || \
            (stop_bits == NUART_STOP_BITS_2));
    
    if (stop_bits == NUART_STOP_BITS_2) {
        sfr->mode.set = 0x1u << UxMODE_STSEL_Pos;
    }
    
    /* Setup data bits & parity */
    NASSERT((data_bits == NUART_DATA_BITS_8) || \
            (data_bits == NUART_DATA_BITS_9));
    
    if (data_bits == NUART_DATA_BITS_8) {
        NASSERT((parity == NUART_PARITY_NONE) || \
                (parity == NUART_PARITY_EVEN) || \
                (parity == NUART_PARITY_ODD));
        
        if (parity == NUART_PARITY_ODD) {
            sfr->mode.set = 0x2u << UxMODE_PDSEL_Pos;
        } else if (parity == NUART_PARITY_EVEN) {
            sfr->mode.set = 0x1u << UxMODE_PDSEL_Pos;
        }
    } else {
        NASSERT(parity == NUART_PARITY_NONE);
        sfr->mode.set = 0x3u << UxMODE_PDSEL_Pos;
    }
    
    /* Setup data polarity */
    if ((control_code & NUART_CPOL_Msk) == NUART_CPOL_1) {
        sfr->mode.set = 0x1u << UxMODE_RXINV_Pos;
        sfr->sta.set  = 0x1u << UxSTA_UTXINV_Pos;
    }
    /* Setup data phase */
    NASSERT((control_code & NUART_CPHA_Msk) == NUART_CPHA_0);
    
    /* Setup low-power wakeup event: TODO: Create API for this feature. */
    /* MODE:WAKE -> leave to zero: Wake up is disabled. */
    /* MODE:SIDL -> leave to zero: Continue operation in Idle mode. */
    
    /* Setup flow control */
#if defined(HAS_MODE_UEN)
    {
        uint32_t flow_control = control_code & NUART_FLOW_CONTROL_Msk;
         
        NASSERT((flow_control == NUART_FLOW_CONTROL_NONE) || \
            (flow_control == NUART_FLOW_CONTROL_RTS)  || \
            (flow_control == NUART_FLOW_CONTROL_RTS_CTS));
    
        if (flow_control == NUART_FLOW_CONTROL_RTS) {
            sfr->mode.set = 0x1ul << UxMODE_UEN_Pos;
        } else if (flow_control == NUART_FLOW_CONTROL_RTS_CTS) {
            sfr->mode.set = 0x2ul << UxMODE_UEN_Pos;
        }
    }
#else
    NASSERT((control_code & NUART_FLOW_CONTROL_Msk) == NUART_FLOW_CONTROL_NONE);
#endif
#if defined(HAS_MODE_RTSMD)
    /* Setup MODE:RTSMD -> leave to zero: UxRTS pin in Flow Control Mode. */
#endif
    /* Setup interrupts */
    pic32_isr_clear_flag(uart->desc->vector_id_e_rx_tx, UART_E);
    pic32_isr_clear_flag(uart->desc->vector_id_e_rx_tx, UART_RX);
    pic32_isr_clear_flag(uart->desc->vector_id_e_rx_tx, UART_TX);
    pic32_isr_set_prio(
            uart->desc->vector_id_e_rx_tx, 
            uart->desc->board_config->e_rx_tx_isr_prio);
    
    sfr->mode.set = 0x1ul << UxMODE_ON_Pos; /* Turn on UART peripheral */
}

static void pic32_uart_isr_handler(enum nuart_id uart_id)
{
    struct pic32_uart * uart = &g_pic32_uarts[uart_id];
    struct pic32_periph_reg * ifs_reg;
    uint_fast8_t ifs_bit;
    uint32_t events = 0u;
    
    pic32_isr_resolve_ifs(uart->desc->vector_id_e_rx_tx, &ifs_reg, &ifs_bit);
    
    if (pic32_isr_resolved_is_flagged(ifs_reg, ifs_bit, UART_E)) {
        /* UART x Error interrupt */
        uint32_t status = uart->sfr->sta.reg;
        
        if (status & (0x1ul << UxSTA_OERR_Pos)) {
            uart->sfr->sta.clr = 0x1ul << UxSTA_OERR_Pos;
            events |= NUART_EVENT_RX_OVERFLOW;
        }
        if (status & (0x1ul << UxSTA_FERR_Pos)) {
            events |= NUART_EVENT_RX_FRAMING_ERROR;
        }
        if (status & (0x1ul << UxSTA_PERR_Pos)) {
            events |= NUART_EVENT_RX_PARITY_ERROR;
        }
        pic32_isr_resolved_clear_flag(ifs_reg, ifs_bit, UART_E);
    }
    
    if (pic32_isr_resolved_is_flagged(ifs_reg, ifs_bit, UART_RX)) {
        /* UART x Receiver interrupt */
        pic32_isr_resolved_clear_flag(ifs_reg, ifs_bit, UART_RX);
    }
    if (pic32_isr_resolved_is_flagged(ifs_reg, ifs_bit, UART_TX)) {
        /* UART x Transmitter interrupt */
        pic32_isr_resolved_clear_flag(ifs_reg, ifs_bit, UART_TX);
    }
    
    if (events != 0u) {
        if (uart->callback) {
            uart->callback(uart_id, events);
        }
    }
}

void nuart_init(enum nuart_id uart_id, nuart_callback * callback)
{
    struct pic32_uart * uart;
    
    NASSERT(uart_id < NBITS_ARRAY_SIZE(g_pic32_uarts));
    
    uart = &g_pic32_uarts[uart_id];
    uart->callback = callback;
}

void nuart_term(enum nuart_id uart_id)
{
    struct pic32_uart * uart;
    
    NASSERT(uart_id < NBITS_ARRAY_SIZE(g_pic32_uarts));
    
    uart = &g_pic32_uarts[uart_id];
}

uint32_t nuart_capabilities(enum nuart_id uart_id)
{
    struct pic32_uart * uart;
    
    NASSERT(uart_id < NBITS_ARRAY_SIZE(g_pic32_uarts));
    
    uart = &g_pic32_uarts[uart_id];  

    return uart->desc->capabilities;
}

void nuart_control(enum nuart_id uart_id, uint32_t control_code, uint32_t arg)
{
    struct pic32_uart * uart = &g_pic32_uarts[uart_id];
    
    switch (control_code & NUART_COMMAND_Msk) {
        case NUART_COMMAND_SETUP:
            pic32_uart_setup(uart, control_code, arg);
            break;
        case NUART_COMMAND_ABORT_SEND:
            break;
        case NUART_COMMAND_ABORT_RECEIVE:
            break;
        case NUART_COMMAND_ABORT_TRANSFER:
            break;
        default:
            NASSERT_ALWAYS(control_code);
            break;
    }
}

void nuart_send(enum nuart_id uart_id, const void * data, size_t size)
{
    struct pic32_uart * uart;
    
    NASSERT(uart_id < NBITS_ARRAY_SIZE(g_pic32_uarts));
    
    uart = &g_pic32_uarts[uart_id];
    uart->buff_out = data;
    uart->buff_size = size;
    
    uart->sfr->sta.clr = 0x3ul << UxSTA_UTXISEL_Pos;
    
    if (size >= HAS_TX_FIFO) {
        /* Interrupt is generated and asserted while the transmit buffer is 
         * empty.
         */
        uart->sfr->sta.set = 0x2ul << UxSTA_UTXISEL_Pos;
    } else {
        
    }
    uart->sfr->sta.set = 0x1ul << UxSTA_UTXEN_Pos;
}

void nuart_receive(enum nuart_id uart_id, void * data, size_t size)
{
    
}

void nuart_transfer(enum nuart_id uart_id, const void * output, void * input, size_t size)
{
    
}

uint32_t nuart_rx_count(const enum nuart_id uart_id)
{
    
}

uint32_t nuart_tx_count(const enum nuart_id uart_id)
{
    
}

#if (NBOARD_USES_UART_1 == 1)
void __ISR(_UART_1_VECTOR, ipl1AUTO) pic32_uart_1_isr_handler(void)
{
    pic32_uart_isr_handler(NUART_ID_1);
}
#endif

#if (NBOARD_USES_UART_2 == 1)
void __ISR(_UART_2_VECTOR, ipl1AUTO) pic32_uart_2_isr_handler(void)
{
    pic32_uart_isr_handler(NUART_ID_2);
}
#endif

#if (NBOARD_USES_UART_3 == 1)
void __ISR(_UART_3_VECTOR, ipl1AUTO) pic32_uart_3_isr_handler(void)
{
    pic32_uart_isr_handler(NUART_ID_3);
}
#endif

#if (NBOARD_USES_UART_4 == 1)
void __ISR(_UART_4_VECTOR, ipl1AUTO) pic32_uart_4_isr_handler(void)
{
    pic32_uart_isr_handler(NUART_ID_4);
}
#endif

#if (NBOARD_USES_UART_5 == 1)
void __ISR(_UART_5_VECTOR, ipl1AUTO) pic32_uart_5_isr_handler(void)
{
    pic32_uart_isr_handler(NUART_ID_5);
}
#endif